"""
Задача 1.
Поработайте с переменными, создайте несколько, выведите на экран, запросите у пользователя несколько чисел и строк и
сохраните в переменные, выведите на экран.
"""

a = input('Enter your name: ')
b = int(input('Enter your age '))
c = float(input('Enter your favourite number '))
print(a, b, c)